#include "mapLake.h"



mapLake::mapLake()
{
	setName("┐Ў┼═┼╖┤¤");
}


mapLake::~mapLake()
{
}

void mapLake::showImage()
{
	cout << "бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс" << endl;
	cout << "бс                           бс      бс      бс                               бс" << endl;
	cout << "бс    бс  бс  бс         бсбс  бсбсбс  бсбсбс  бсбс           бс  бс  бс      бс" << endl;
	cout << "бс    бсбсбсбсбс       бс                          бс         бсбсбсбсбс      бс" << endl;
	cout << "бс    бс      бс       бс    бс      бс      бс    бс         бс      бс      бс" << endl;
	cout << "бс    бс  бс  бс       бс                          бс         бс  бс  бс      бс" << endl;
	cout << "бс  бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс    бс" << endl;
	cout << "бс  бс                                                                  бс    бс" << endl;
	cout << "бс  бс                          бсбсбсбсбсбсбсбс                        бс    бс" << endl;
	cout << "бс  бс                     бсбсбс              бсбсбс                   бс    бс" << endl;
	cout << "бс  бс                   бс                          бс                 бс    бс" << endl;
	cout << "бс  бс                  бс       бсбсбсбсбсбсбс        бс               бс    бс" << endl;
	cout << "бс  бс                  бс       бс    бс    бс        бс               бс    бс" << endl;
	cout << "бс  бс                  бс       бс    бс    бс        бс               бс    бс" << endl;
	cout << "бс  бс                  бс       бс    бс    бс        бс               бс    бс" << endl;
	cout << "бс  бс                  бс       бс    бс    бс        бс               бс    бс" << endl;
	cout << "бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс" << endl;
	cout << "бс                                                                            бс" << endl;
	cout << "бс      бсбсбс                                  бсбсбсбсбсбс                  бс" << endl;
	cout << "бс   бс       бсбс                        бсбсбс        бс  бсбс              бс" << endl;
	cout << "бсбсбс             бсбс                 бсбс бс         бс      бсбс        бсбс" << endl;
	cout << "бс  бс                бсбс          бсбс     бс        бс          бсбс   бс  бс" << endl;
	cout << "бс бс                   бсбсбсбсбсбс  бс    бс         бс              бсбс   бс" << endl;
	cout << "бс  бс                   бс       бс  бс    бс        бс                бс    бс" << endl;
	cout << "бс  бс                  бс         бсбсбсбсбсбс         бс                бс  бс" << endl;
	cout << "бс бс                       бс                          бс               бс   бс" << endl;
	cout << "бс  бс                  бс                            бс                  бс  бс" << endl;
	cout << "бс  бс                      бсбсбс              бсбсбс                    бс  бс" << endl;
	cout << "бс   бс                          бсбсбсбсбсбсбсбс                        бс   бс" << endl;
	cout << "бс  бс                                                                    бс  бс" << endl;
	cout << "бс  бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс  бс" << endl;
	cout << "бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс" << endl;
}