#include "mapStone.h"



mapStone::mapStone()
{
	setName("╜║┼ц╕╢┐ю╞╛");
}


mapStone::~mapStone()
{
}

void mapStone::showImage()
{
	cout << "бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс" << endl;
	cout << "бс           бс          бс                        бс                         бс" << endl;
	cout << "бс         бс  бс      бс  бс                    бс  бс                       бс" << endl;
	cout << "бс       бс      бс  бс      бс                бс      бс                     бс" << endl;
	cout << "бс     бс          бс          бс            бс          бс                   бс" << endl;
	cout << "бс   бс              бс          бс        бс              бс                 бс" << endl;
	cout << "бс бс            бс    бс          бс    бс                  бс               бс" << endl;
	cout << "бсбс           бс  бс    бс          бсбс                      бс             бс" << endl;
	cout << "бс           бс      бс    бс        бс                          бс           бс" << endl;
	cout << "бс         бс          бс    бс    бс                              бс         бс" << endl;
	cout << "бс       бс              бс    бсбс                                  бс       бс" << endl;
	cout << "бс     бс                  бс  бс                                      бс     бс" << endl;
	cout << "бс   бс                      бс                                          бс бсбс" << endl;
	cout << "бс бс                          бс                                         бс  бс" << endl;
	cout << "бс                               бс                                     бс    бс" << endl;
	cout << "бс                                 бс                                 бс      бс" << endl;
	cout << "бс                                   бс                    бсбсбсбсбсбс бс    бс" << endl;
	cout << "бс                                     бс  бсбсбсбсбс     бс           бс     бс" << endl;
	cout << "бс                      бсбсбсбсбсбсбс   бс          бс бс             бс     бс" << endl;
	cout << "бсбсбсбсбсбсбсбс        бс             бсбс             бс              бс    бс" << endl;
	cout << "бс             бс    бс  бс             бс             бс               бс    бс" << endl;
	cout << "бс          бс   бс  бс    бс       бсбс               бс              бс     бс" << endl;
	cout << "бс        бс     бсбс      бс     бс  бс               бс бс           бс     бс" << endl;
	cout << "бс      бс       бсбс     бс    бс    бс               бс   бс         бс     бс" << endl;
	cout << "бс   бс          бсбс        бс       бс               бс      бс     бс      бс" << endl;
	cout << "бс   бс       бс бсбс      бс           бс           бс           бс   бс     бс" << endl;
	cout << "бс   бс       бс бсбс   бс   бс       бс  бсбсбсбсбсбс               бсбс     бс" << endl;
	cout << "бс   бс        бсбсбсбс        бс    бс               бс               бс     бс" << endl;
	cout << "бс   бс        бсбсбс          бс     бс              бс               бс     бс" << endl;
	cout << "бс   бс        бсбс  бс        бс    бс               бс               бс     бс" << endl;
	cout << "бс    бс      бс бс  бс        бс       бс         бс                 бс      бс" << endl;
	cout << "бсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбсбс" << endl;
}